HloModule cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_6__XlaNumResourceArgs_34_.612

%max_F32.62 (lhs.63: f32[], rhs.64: f32[]) -> f32[] {
  %lhs.63 = f32[] parameter(0)
  %rhs.64 = f32[] parameter(1)
  ROOT %maximum.65 = f32[] maximum(f32[] %lhs.63, f32[] %rhs.64)
}

%max_float_.125 (x.126: f32[], y.127: f32[]) -> f32[] {
  %x.126 = f32[] parameter(0)
  %y.127 = f32[] parameter(1)
  ROOT %maximum.128 = f32[] maximum(f32[] %x.126, f32[] %y.127)
}

%ge_F32.329 (lhs.330: f32[], rhs.331: f32[]) -> pred[] {
  %lhs.330 = f32[] parameter(0)
  %rhs.331 = f32[] parameter(1)
  ROOT %compare.332 = pred[] compare(f32[] %lhs.330, f32[] %rhs.331), direction=GE
}

%add_F32.333 (lhs.334: f32[], rhs.335: f32[]) -> f32[] {
  %lhs.334 = f32[] parameter(0)
  %rhs.335 = f32[] parameter(1)
  ROOT %add.336 = f32[] add(f32[] %lhs.334, f32[] %rhs.335)
}

%scalar_max_computation (scalar_lhs: f32[], scalar_rhs: f32[]) -> f32[] {
  %scalar_lhs = f32[] parameter(0)
  %scalar_rhs = f32[] parameter(1)
  ROOT %maximum = f32[] maximum(f32[] %scalar_lhs, f32[] %scalar_rhs)
}

%scalar_add_computation (scalar_lhs.1: f32[], scalar_rhs.1: f32[]) -> f32[] {
  %scalar_lhs.1 = f32[] parameter(0)
  %scalar_rhs.1 = f32[] parameter(1)
  ROOT %add = f32[] add(f32[] %scalar_lhs.1, f32[] %scalar_rhs.1)
}

%fused_computation.6 (param_0.6: f32[4608,128], param_1.247: f32[], param_2.287: f32[4608,128], param_3.139: f32[], param_4.101: f32[4608,128], param_5.94: f32[4608,128], param_6.79: f32[]) -> (f32[4608,128], f32[4608,128], f32[4608,128]) {
  %param_0.6 = f32[4608,128]{1,0} parameter(0)
  %param_2.287 = f32[4608,128]{1,0} parameter(2)
  %param_4.101 = f32[4608,128]{1,0} parameter(4)
  %subtract.9.clone.1 = f32[4608,128]{1,0} subtract(f32[4608,128]{1,0} %param_4.101, f32[4608,128]{1,0} %param_2.287), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %constant_22_clone_1 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_3.139 = f32[] parameter(3)
  %subtract.42.clone.1 = f32[] subtract(f32[] %constant_22_clone_1, f32[] %param_3.139), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.17.clone.1 = f32[4608,128]{1,0} broadcast(f32[] %subtract.42.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %multiply.11.clone.1 = f32[4608,128]{1,0} multiply(f32[4608,128]{1,0} %subtract.9.clone.1, f32[4608,128]{1,0} %broadcast.17.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %add.9.clone.1 = f32[4608,128]{1,0} add(f32[4608,128]{1,0} %param_2.287, f32[4608,128]{1,0} %multiply.11.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %param_1.247 = f32[] parameter(1)
  %broadcast.15 = f32[4608,128]{1,0} broadcast(f32[] %param_1.247), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %multiply.8 = f32[4608,128]{1,0} multiply(f32[4608,128]{1,0} %add.9.clone.1, f32[4608,128]{1,0} %broadcast.15), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %param_5.94 = f32[4608,128]{1,0} parameter(5)
  %multiply.10.clone.1 = f32[4608,128]{1,0} multiply(f32[4608,128]{1,0} %param_4.101, f32[4608,128]{1,0} %param_4.101), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %subtract.8.clone.1 = f32[4608,128]{1,0} subtract(f32[4608,128]{1,0} %multiply.10.clone.1, f32[4608,128]{1,0} %param_5.94), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %param_6.79 = f32[] parameter(6)
  %subtract.43.clone.1 = f32[] subtract(f32[] %constant_22_clone_1, f32[] %param_6.79), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.16.clone.1 = f32[4608,128]{1,0} broadcast(f32[] %subtract.43.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %multiply.9.clone.1 = f32[4608,128]{1,0} multiply(f32[4608,128]{1,0} %subtract.8.clone.1, f32[4608,128]{1,0} %broadcast.16.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %add.8.clone.1 = f32[4608,128]{1,0} add(f32[4608,128]{1,0} %param_5.94, f32[4608,128]{1,0} %multiply.9.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %sqrt.2 = f32[4608,128]{1,0} sqrt(f32[4608,128]{1,0} %add.8.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %constant_21 = f32[] constant(1e-07), metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %broadcast.14 = f32[4608,128]{1,0} broadcast(f32[] %constant_21), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %add.7 = f32[4608,128]{1,0} add(f32[4608,128]{1,0} %sqrt.2, f32[4608,128]{1,0} %broadcast.14), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %divide.3 = f32[4608,128]{1,0} divide(f32[4608,128]{1,0} %multiply.8, f32[4608,128]{1,0} %add.7), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  %subtract.7 = f32[4608,128]{1,0} subtract(f32[4608,128]{1,0} %param_0.6, f32[4608,128]{1,0} %divide.3), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_6/ResourceApplyAdam"}
  ROOT %tuple.15 = (f32[4608,128]{1,0}, f32[4608,128]{1,0}, f32[4608,128]{1,0}) tuple(f32[4608,128]{1,0} %subtract.7, f32[4608,128]{1,0} %add.9.clone.1, f32[4608,128]{1,0} %add.8.clone.1)
}

%fused_computation.15 (param_0.18: f32[128], param_1.249: f32[], param_2.291: f32[128], param_3.146: f32[], param_4.113: f32[128], param_5.113: f32[128], param_6.96: f32[], param_7.122: f32[128], param_8.75: f32[128], param_9.57: f32[128], param_10.32: f32[128]) -> (f32[128], f32[128], f32[128], f32[128], f32[128], f32[128]) {
  %param_0.18 = f32[128]{0} parameter(0)
  %param_2.291 = f32[128]{0} parameter(2)
  %param_4.113 = f32[128]{0} parameter(4)
  %subtract.18.clone.1 = f32[128]{0} subtract(f32[128]{0} %param_4.113, f32[128]{0} %param_2.291), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %constant_31_clone_1 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_3.146 = f32[] parameter(3)
  %subtract.48.clone.1 = f32[] subtract(f32[] %constant_31_clone_1, f32[] %param_3.146), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.66.clone.1 = f32[128]{0} broadcast(f32[] %subtract.48.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %multiply.23.clone.1 = f32[128]{0} multiply(f32[128]{0} %subtract.18.clone.1, f32[128]{0} %broadcast.66.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %add.18.clone.1 = f32[128]{0} add(f32[128]{0} %param_2.291, f32[128]{0} %multiply.23.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %param_1.249 = f32[] parameter(1)
  %broadcast.64 = f32[128]{0} broadcast(f32[] %param_1.249), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %multiply.20 = f32[128]{0} multiply(f32[128]{0} %add.18.clone.1, f32[128]{0} %broadcast.64), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %param_5.113 = f32[128]{0} parameter(5)
  %multiply.22.clone.1 = f32[128]{0} multiply(f32[128]{0} %param_4.113, f32[128]{0} %param_4.113), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %subtract.17.clone.1 = f32[128]{0} subtract(f32[128]{0} %multiply.22.clone.1, f32[128]{0} %param_5.113), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %param_6.96 = f32[] parameter(6)
  %subtract.49.clone.1 = f32[] subtract(f32[] %constant_31_clone_1, f32[] %param_6.96), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.67.clone.1 = f32[128]{0} broadcast(f32[] %subtract.49.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %multiply.21.clone.1 = f32[128]{0} multiply(f32[128]{0} %subtract.17.clone.1, f32[128]{0} %broadcast.67.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %add.17.clone.1 = f32[128]{0} add(f32[128]{0} %param_5.113, f32[128]{0} %multiply.21.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %sqrt.5 = f32[128]{0} sqrt(f32[128]{0} %add.17.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %constant_30 = f32[] constant(1e-07), metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %broadcast.65 = f32[128]{0} broadcast(f32[] %constant_30), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %add.16 = f32[128]{0} add(f32[128]{0} %sqrt.5, f32[128]{0} %broadcast.65), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %divide.6 = f32[128]{0} divide(f32[128]{0} %multiply.20, f32[128]{0} %add.16), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %subtract.16 = f32[128]{0} subtract(f32[128]{0} %param_0.18, f32[128]{0} %divide.6), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_5/ResourceApplyAdam"}
  %param_7.122 = f32[128]{0} parameter(7)
  %param_10.32 = f32[128]{0} parameter(10)
  %param_9.57 = f32[128]{0} parameter(9)
  %subtract.12.clone.1.clone.1 = f32[128]{0} subtract(f32[128]{0} %param_9.57, f32[128]{0} %param_10.32), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %multiply.15.clone.1.clone.1 = f32[128]{0} multiply(f32[128]{0} %subtract.12.clone.1.clone.1, f32[128]{0} %broadcast.66.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %add.12.clone.1.clone.1 = f32[128]{0} add(f32[128]{0} %param_10.32, f32[128]{0} %multiply.15.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %multiply.12.clone.1 = f32[128]{0} multiply(f32[128]{0} %add.12.clone.1.clone.1, f32[128]{0} %broadcast.64), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %param_8.75 = f32[128]{0} parameter(8)
  %multiply.14.clone.1.clone.1 = f32[128]{0} multiply(f32[128]{0} %param_9.57, f32[128]{0} %param_9.57), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %subtract.11.clone.1.clone.1 = f32[128]{0} subtract(f32[128]{0} %multiply.14.clone.1.clone.1, f32[128]{0} %param_8.75), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %multiply.13.clone.1.clone.1 = f32[128]{0} multiply(f32[128]{0} %subtract.11.clone.1.clone.1, f32[128]{0} %broadcast.67.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %add.11.clone.1.clone.1 = f32[128]{0} add(f32[128]{0} %param_8.75, f32[128]{0} %multiply.13.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %sqrt.3.clone.1 = f32[128]{0} sqrt(f32[128]{0} %add.11.clone.1.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %add.10.clone.1 = f32[128]{0} add(f32[128]{0} %sqrt.3.clone.1, f32[128]{0} %broadcast.65), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %divide.4.clone.1 = f32[128]{0} divide(f32[128]{0} %multiply.12.clone.1, f32[128]{0} %add.10.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  %subtract.10.clone.1 = f32[128]{0} subtract(f32[128]{0} %param_7.122, f32[128]{0} %divide.4.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_7/ResourceApplyAdam"}
  ROOT %tuple.28 = (f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}, f32[128]{0}) tuple(f32[128]{0} %subtract.16, f32[128]{0} %add.18.clone.1, f32[128]{0} %add.17.clone.1, f32[128]{0} %subtract.10.clone.1, f32[128]{0} %add.12.clone.1.clone.1, f32[128]{0} %add.11.clone.1.clone.1)
}

%add_float_.263 (x.264: f32[], y.265: f32[]) -> f32[] {
  %x.264 = f32[] parameter(0)
  %y.265 = f32[] parameter(1)
  ROOT %add.266 = f32[] add(f32[] %x.264, f32[] %y.265)
}

%fused_computation.18 (param_0.77: f32[1024,128,6,6]) -> f32[128] {
  %param_0.77 = f32[1024,128,6,6]{3,2,1,0} parameter(0)
  %bitcast.7 = f32[1024,128,36]{2,1,0} bitcast(f32[1024,128,6,6]{3,2,1,0} %param_0.77)
  %constant_33 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  ROOT %reduce.5 = f32[128]{0} reduce(f32[1024,128,36]{2,1,0} %bitcast.7, f32[] %constant_33), dimensions={0,2}, to_apply=%add_float_.263, metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/BiasAdd_grad/BiasAddGrad"}
}

%add_float_.344 (x.345: f32[], y.346: f32[]) -> f32[] {
  %x.345 = f32[] parameter(0)
  %y.346 = f32[] parameter(1)
  ROOT %add.347 = f32[] add(f32[] %x.345, f32[] %y.346)
}

%fused_computation.25 (param_0.82: f32[1024,64,20,20]) -> f32[64] {
  %param_0.82 = f32[1024,64,20,20]{3,2,1,0} parameter(0)
  %bitcast.8 = f32[1024,64,400]{2,1,0} bitcast(f32[1024,64,20,20]{3,2,1,0} %param_0.82)
  %constant_42 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  ROOT %reduce.6 = f32[64]{0} reduce(f32[1024,64,400]{2,1,0} %bitcast.8, f32[] %constant_42), dimensions={0,2}, to_apply=%add_float_.344, metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/BiasAdd_grad/BiasAddGrad"}
}

%fused_computation.31 (param_0.87: f32[], param_1.170: f32[], param_2.199: f32[], param_3.90: s64[]) -> f32[] {
  %param_1.170 = f32[] parameter(1)
  %constant_48 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_2.199 = f32[] parameter(2)
  %param_3.90 = s64[] parameter(3)
  %constant_10 = s64[] constant(1), metadata={op_type="AddV2" op_name="Adam/add"}
  %add.30 = s64[] add(s64[] %param_3.90, s64[] %constant_10), metadata={op_type="AddV2" op_name="Adam/add"}
  %convert.0 = f32[] convert(s64[] %add.30), metadata={op_type="Cast" op_name="Adam/Cast_1"}
  %power.1 = f32[] power(f32[] %param_2.199, f32[] %convert.0), metadata={op_type="Pow" op_name="Adam/Pow_1"}
  %subtract.31 = f32[] subtract(f32[] %constant_48, f32[] %power.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %sqrt.10 = f32[] sqrt(f32[] %subtract.31), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %multiply.39 = f32[] multiply(f32[] %param_1.170, f32[] %sqrt.10), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %param_0.87 = f32[] parameter(0)
  %power.0 = f32[] power(f32[] %param_0.87, f32[] %convert.0), metadata={op_type="Pow" op_name="Adam/Pow"}
  %subtract.30 = f32[] subtract(f32[] %constant_48, f32[] %power.0), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  ROOT %divide.11 = f32[] divide(f32[] %multiply.39, f32[] %subtract.30), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
}

%add_float_.409 (x.410: f32[], y.411: f32[]) -> f32[] {
  %x.410 = f32[] parameter(0)
  %y.411 = f32[] parameter(1)
  ROOT %add.412 = f32[] add(f32[] %x.410, f32[] %y.411)
}

%fused_computation.33 (param_0.88: f32[1024,32,24,24]) -> f32[32] {
  %param_0.88 = f32[1024,32,24,24]{3,2,1,0} parameter(0)
  %bitcast.9 = f32[1024,32,576]{2,1,0} bitcast(f32[1024,32,24,24]{3,2,1,0} %param_0.88)
  %constant_51 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  ROOT %reduce.7 = f32[32]{0} reduce(f32[1024,32,576]{2,1,0} %bitcast.9, f32[] %constant_51), dimensions={0,2}, to_apply=%add_float_.409, metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/BiasAdd_grad/BiasAddGrad"}
}

%fused_computation.34 (param_0.48: f32[1024,32,24,24], param_1.107: f32[1024,32,24,24]) -> f32[1024,32,24,24] {
  %param_1.107 = f32[1024,32,24,24]{3,2,1,0} parameter(1)
  %constant_53 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %broadcast.38 = f32[1024,32,24,24]{3,2,1,0} broadcast(f32[] %constant_53), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"}
  %compare.0 = pred[1024,32,24,24]{3,2,1,0} compare(f32[1024,32,24,24]{3,2,1,0} %param_1.107, f32[1024,32,24,24]{3,2,1,0} %broadcast.38), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Relu_grad/ReluGrad"}
  %param_0.48 = f32[1024,32,24,24]{3,2,1,0} parameter(0)
  ROOT %select.0 = f32[1024,32,24,24]{3,2,1,0} select(pred[1024,32,24,24]{3,2,1,0} %compare.0, f32[1024,32,24,24]{3,2,1,0} %param_0.48, f32[1024,32,24,24]{3,2,1,0} %broadcast.38), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Relu_grad/ReluGrad"}
}

%fused_computation.35 (param_0.50: f32[1024,64,20,20], param_1.110: f32[1024,64,20,20]) -> f32[1024,64,20,20] {
  %param_1.110 = f32[1024,64,20,20]{3,2,1,0} parameter(1)
  %constant_54 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %broadcast.39 = f32[1024,64,20,20]{3,2,1,0} broadcast(f32[] %constant_54), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Relu"}
  %compare.1 = pred[1024,64,20,20]{3,2,1,0} compare(f32[1024,64,20,20]{3,2,1,0} %param_1.110, f32[1024,64,20,20]{3,2,1,0} %broadcast.39), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Relu_grad/ReluGrad"}
  %param_0.50 = f32[1024,64,20,20]{3,2,1,0} parameter(0)
  ROOT %select.1 = f32[1024,64,20,20]{3,2,1,0} select(pred[1024,64,20,20]{3,2,1,0} %compare.1, f32[1024,64,20,20]{3,2,1,0} %param_0.50, f32[1024,64,20,20]{3,2,1,0} %broadcast.39), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Relu_grad/ReluGrad"}
}

%fused_computation.36 (param_0.53: f32[1024,4608], param_1.114: f32[1024,128,6,6]) -> f32[1024,128,6,6] {
  %param_1.114 = f32[1024,128,6,6]{3,2,1,0} parameter(1)
  %constant_55 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %broadcast.41 = f32[1024,128,6,6]{3,2,1,0} broadcast(f32[] %constant_55), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu"}
  %compare.2 = pred[1024,128,6,6]{3,2,1,0} compare(f32[1024,128,6,6]{3,2,1,0} %param_1.114, f32[1024,128,6,6]{3,2,1,0} %broadcast.41), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad"}
  %param_0.53 = f32[1024,4608]{1,0} parameter(0)
  %reshape.2 = f32[1024,6,6,128]{2,1,3,0} reshape(f32[1024,4608]{1,0} %param_0.53), metadata={op_type="Reshape" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/flatten/Reshape_grad/Reshape"}
  %transpose.0 = f32[1024,128,6,6]{3,2,1,0} transpose(f32[1024,6,6,128]{2,1,3,0} %reshape.2), dimensions={0,3,1,2}, metadata={op_type="Transpose" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad-0-TransposeNHWCToNCHW-LayoutOptimizer"}
  ROOT %select.2 = f32[1024,128,6,6]{3,2,1,0} select(pred[1024,128,6,6]{3,2,1,0} %compare.2, f32[1024,128,6,6]{3,2,1,0} %transpose.0, f32[1024,128,6,6]{3,2,1,0} %broadcast.41), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad"}
}

%add_float_.148 (x.149: f32[], y.150: f32[]) -> f32[] {
  %x.149 = f32[] parameter(0)
  %y.150 = f32[] parameter(1)
  ROOT %add.151 = f32[] add(f32[] %x.149, f32[] %y.150)
}

%fused_computation.41 (param_0.108: f32[1024], param_1.195: f32[1024,10], param_2.216: f32[1024], param_3.106: s32[1024]) -> f32[1024] {
  %param_3.106 = s32[1024]{0} parameter(3)
  %convert.6 = f32[1024]{0} convert(s32[1024]{0} %param_3.106), metadata={op_type="Cast" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast"}
  %convert.5 = s64[1024]{0} convert(f32[1024]{0} %convert.6), metadata={op_type="Cast" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast_1"}
  %broadcast.121 = s64[1024,10]{1,0} broadcast(s64[1024]{0} %convert.5), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.2 = s64[1024,10]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.14 = pred[1024,10]{1,0} compare(s64[1024,10]{1,0} %broadcast.121, s64[1024,10]{1,0} %iota.2), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_89 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.120 = f32[1024,10]{1,0} broadcast(f32[] %constant_89), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_64 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %broadcast.119 = f32[1024,10]{1,0} broadcast(f32[] %constant_64), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.11 = f32[1024,10]{1,0} select(pred[1024,10]{1,0} %compare.14, f32[1024,10]{1,0} %broadcast.120, f32[1024,10]{1,0} %broadcast.119), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_86 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.117 = s64[1024]{0} broadcast(s64[] %constant_86), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.13 = pred[1024]{0} compare(s64[1024]{0} %broadcast.117, s64[1024]{0} %convert.5), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_85 = s64[] constant(10), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.116 = s64[1024]{0} broadcast(s64[] %constant_85), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.12 = pred[1024]{0} compare(s64[1024]{0} %convert.5, s64[1024]{0} %broadcast.116), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %and.2 = pred[1024]{0} and(pred[1024]{0} %compare.13, pred[1024]{0} %compare.12), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.114 = f32[1024]{0} broadcast(f32[] %constant_64), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant_84 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.112 = f32[1024]{0} broadcast(f32[] %constant_84), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.10 = f32[1024]{0} select(pred[1024]{0} %and.2, f32[1024]{0} %broadcast.114, f32[1024]{0} %broadcast.112), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.110 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %select.10), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %add.34 = f32[1024,10]{1,0} add(f32[1024,10]{1,0} %select.11, f32[1024,10]{1,0} %broadcast.110), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.0 = f32[1024,10]{1,0} negate(f32[1024,10]{1,0} %add.34), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_1.195 = f32[1024,10]{1,0} parameter(1)
  %param_2.216 = f32[1024]{0} parameter(2)
  %broadcast.98 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %param_2.216), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.61 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %param_1.195, f32[1024,10]{1,0} %broadcast.98), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.108 = f32[1024]{0} parameter(0)
  %broadcast.46 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %param_0.108), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.35 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %subtract.61, f32[1024,10]{1,0} %broadcast.46), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.45 = f32[1024,10]{1,0} multiply(f32[1024,10]{1,0} %negate.0, f32[1024,10]{1,0} %subtract.35), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %reduce.9 = f32[1024]{0} reduce(f32[1024,10]{1,0} %multiply.45, f32[] %constant_64), dimensions={1}, to_apply=%add_float_.148, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
}

%fused_computation.44 (param_0.67: f32[1024,10], param_1.132: f32[1024]) -> f32[1024,10] {
  %param_0.67 = f32[1024,10]{1,0} parameter(0)
  %param_1.132 = f32[1024]{0} parameter(1)
  %broadcast.49 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %param_1.132), dimensions={0}, metadata={op_type="Softmax" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"}
  %subtract.37 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %param_0.67, f32[1024,10]{1,0} %broadcast.49), metadata={op_type="Softmax" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"}
  ROOT %exponential.1 = f32[1024,10]{1,0} exponential(f32[1024,10]{1,0} %subtract.37), metadata={op_type="Softmax" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"}
}

%fused_computation.45 (param_0.70: f32[1024,128,6,6]) -> f32[1024,4608] {
  %param_0.70 = f32[1024,128,6,6]{3,2,1,0} parameter(0)
  %transpose.1 = f32[1024,6,6,128]{2,1,3,0} transpose(f32[1024,128,6,6]{3,2,1,0} %param_0.70), dimensions={0,2,3,1}, metadata={op_type="Transpose" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu-0-1-TransposeNCHWToNHWC-LayoutOptimizer"}
  %copy.71 = f32[1024,6,6,128]{3,2,1,0} copy(f32[1024,6,6,128]{2,1,3,0} %transpose.1), metadata={op_type="Transpose" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu-0-1-TransposeNCHWToNHWC-LayoutOptimizer"}
  ROOT %bitcast.10 = f32[1024,4608]{1,0} bitcast(f32[1024,6,6,128]{3,2,1,0} %copy.71), metadata={op_type="Reshape" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/flatten/Reshape"}
}

%fused_computation.47 (param_0.99: f32[1024,10], param_1.184: f32[1024]) -> f32[1024,10] {
  %constant_68 = f32[] constant(1e-07), metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %broadcast.79 = f32[1024,10]{1,0} broadcast(f32[] %constant_68), dimensions={}, metadata={op_type="Maximum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"}
  %param_0.99 = f32[1024,10]{1,0} parameter(0)
  %param_1.184 = f32[1024]{0} parameter(1)
  %broadcast.83 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %param_1.184), dimensions={0}, metadata={op_type="Softmax" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"}
  %divide.16 = f32[1024,10]{1,0} divide(f32[1024,10]{1,0} %param_0.99, f32[1024,10]{1,0} %broadcast.83), metadata={op_type="Softmax" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"}
  %constant_67 = f32[] constant(0.999999881), metadata={op_type="LessEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value/Minimum_grad/LessEqual"}
  %broadcast.78 = f32[1024,10]{1,0} broadcast(f32[] %constant_67), dimensions={}, metadata={op_type="Minimum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"}
  %clamp.2 = f32[1024,10]{1,0} clamp(f32[1024,10]{1,0} %broadcast.79, f32[1024,10]{1,0} %divide.16, f32[1024,10]{1,0} %broadcast.78), metadata={op_type="Maximum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"}
  ROOT %log.0 = f32[1024,10]{1,0} log(f32[1024,10]{1,0} %clamp.2), metadata={op_type="Log" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Log"}
}

%fused_computation.48 (param_0.97: f32[1024,128]) -> f32[1024,128] {
  %constant_69 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %broadcast.81 = f32[1024,128]{1,0} broadcast(f32[] %constant_69), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"}
  %param_0.97 = f32[1024,128]{1,0} parameter(0)
  ROOT %maximum.2 = f32[1024,128]{1,0} maximum(f32[1024,128]{1,0} %broadcast.81, f32[1024,128]{1,0} %param_0.97), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"}
}

%fused_computation.49 (param_0.106: f32[1024,10], param_1.192: f32[1024]) -> f32[1024,10] {
  %param_0.106 = f32[1024,10]{1,0} parameter(0)
  %param_1.192 = f32[1024]{0} parameter(1)
  %broadcast.95 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %param_1.192), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.59 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %param_0.106, f32[1024,10]{1,0} %broadcast.95), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  ROOT %exponential.2 = f32[1024,10]{1,0} exponential(f32[1024,10]{1,0} %subtract.59), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
}

%fused_computation.51 (param_0.129: f32[], param_1.216: f32[5,5,1,32], param_2.243: f32[5,5,1,32], param_3.154: f32[], param_4.125: f32[5,5,1,32], param_5.133: f32[], param_6.118: f32[5,5,1,32]) -> (f32[5,5,1,32], f32[5,5,1,32], f32[5,5,1,32]) {
  %param_2.243 = f32[5,5,1,32]{3,2,1,0} parameter(2)
  %copy.84 = f32[5,5,1,32]{1,0,2,3} copy(f32[5,5,1,32]{3,2,1,0} %param_2.243), metadata={op_name="XLA_Args"}
  %param_1.216 = f32[5,5,1,32]{1,0,2,3} parameter(1)
  %subtract.83 = f32[5,5,1,32]{1,0,2,3} subtract(f32[5,5,1,32]{1,0,2,3} %param_1.216, f32[5,5,1,32]{1,0,2,3} %copy.84), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %constant_194 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.129 = f32[] parameter(0)
  %subtract.82 = f32[] subtract(f32[] %constant_194, f32[] %param_0.129), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.253 = f32[5,5,1,32]{1,0,2,3} broadcast(f32[] %subtract.82), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %multiply.71 = f32[5,5,1,32]{1,0,2,3} multiply(f32[5,5,1,32]{1,0,2,3} %subtract.83, f32[5,5,1,32]{1,0,2,3} %broadcast.253), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %add.52 = f32[5,5,1,32]{1,0,2,3} add(f32[5,5,1,32]{1,0,2,3} %copy.84, f32[5,5,1,32]{1,0,2,3} %multiply.71), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %copy.82 = f32[5,5,1,32]{3,2,1,0} copy(f32[5,5,1,32]{1,0,2,3} %add.52), metadata={op_name="XLA_Retvals"}
  %param_6.118 = f32[5,5,1,32]{3,2,1,0} parameter(6)
  %copy.74.clone.1 = f32[5,5,1,32]{1,0,2,3} copy(f32[5,5,1,32]{3,2,1,0} %param_6.118), metadata={op_name="XLA_Args"}
  %param_5.133 = f32[] parameter(5)
  %broadcast.31.clone.1 = f32[5,5,1,32]{1,0,2,3} broadcast(f32[] %param_5.133), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %multiply.32.clone.1 = f32[5,5,1,32]{1,0,2,3} multiply(f32[5,5,1,32]{1,0,2,3} %add.52, f32[5,5,1,32]{1,0,2,3} %broadcast.31.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %param_4.125 = f32[5,5,1,32]{3,2,1,0} parameter(4)
  %copy.76.clone.1 = f32[5,5,1,32]{1,0,2,3} copy(f32[5,5,1,32]{3,2,1,0} %param_4.125), metadata={op_name="XLA_Args"}
  %multiply.63.clone.1 = f32[5,5,1,32]{1,0,2,3} multiply(f32[5,5,1,32]{1,0,2,3} %param_1.216, f32[5,5,1,32]{1,0,2,3} %param_1.216), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %subtract.71.clone.1 = f32[5,5,1,32]{1,0,2,3} subtract(f32[5,5,1,32]{1,0,2,3} %multiply.63.clone.1, f32[5,5,1,32]{1,0,2,3} %copy.76.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %param_3.154 = f32[] parameter(3)
  %subtract.70.clone.1 = f32[] subtract(f32[] %constant_194, f32[] %param_3.154), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.245.clone.1 = f32[5,5,1,32]{1,0,2,3} broadcast(f32[] %subtract.70.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %multiply.62.clone.1 = f32[5,5,1,32]{1,0,2,3} multiply(f32[5,5,1,32]{1,0,2,3} %subtract.71.clone.1, f32[5,5,1,32]{1,0,2,3} %broadcast.245.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %add.45.clone.1 = f32[5,5,1,32]{1,0,2,3} add(f32[5,5,1,32]{1,0,2,3} %copy.76.clone.1, f32[5,5,1,32]{1,0,2,3} %multiply.62.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %sqrt.8.clone.1 = f32[5,5,1,32]{1,0,2,3} sqrt(f32[5,5,1,32]{1,0,2,3} %add.45.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %constant_44_clone_1 = f32[] constant(1e-07), metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %broadcast.30.clone.1 = f32[5,5,1,32]{1,0,2,3} broadcast(f32[] %constant_44_clone_1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %add.25.clone.1 = f32[5,5,1,32]{1,0,2,3} add(f32[5,5,1,32]{1,0,2,3} %sqrt.8.clone.1, f32[5,5,1,32]{1,0,2,3} %broadcast.30.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %divide.9.clone.1 = f32[5,5,1,32]{1,0,2,3} divide(f32[5,5,1,32]{1,0,2,3} %multiply.32.clone.1, f32[5,5,1,32]{1,0,2,3} %add.25.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %subtract.25.clone.1 = f32[5,5,1,32]{1,0,2,3} subtract(f32[5,5,1,32]{1,0,2,3} %copy.74.clone.1, f32[5,5,1,32]{1,0,2,3} %divide.9.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update/ResourceApplyAdam"}
  %copy.68.clone.1 = f32[5,5,1,32]{3,2,1,0} copy(f32[5,5,1,32]{1,0,2,3} %subtract.25.clone.1), metadata={op_name="XLA_Retvals"}
  %copy.77.clone.1 = f32[5,5,1,32]{3,2,1,0} copy(f32[5,5,1,32]{1,0,2,3} %add.45.clone.1), metadata={op_name="XLA_Retvals"}
  ROOT %tuple.27 = (f32[5,5,1,32]{3,2,1,0}, f32[5,5,1,32]{3,2,1,0}, f32[5,5,1,32]{3,2,1,0}) tuple(f32[5,5,1,32]{3,2,1,0} %copy.82, f32[5,5,1,32]{3,2,1,0} %copy.68.clone.1, f32[5,5,1,32]{3,2,1,0} %copy.77.clone.1)
}

%fused_computation.53 (param_0.141: f32[], param_1.230: f32[5,5,32,64], param_2.262: f32[5,5,32,64], param_3.149: f32[], param_4.117: f32[5,5,32,64], param_5.120: f32[], param_6.105: f32[5,5,32,64]) -> (f32[5,5,32,64], f32[5,5,32,64], f32[5,5,32,64]) {
  %param_2.262 = f32[5,5,32,64]{3,2,1,0} parameter(2)
  %copy.94 = f32[5,5,32,64]{1,0,2,3} copy(f32[5,5,32,64]{3,2,1,0} %param_2.262), metadata={op_name="XLA_Args"}
  %param_1.230 = f32[5,5,32,64]{1,0,2,3} parameter(1)
  %subtract.99 = f32[5,5,32,64]{1,0,2,3} subtract(f32[5,5,32,64]{1,0,2,3} %param_1.230, f32[5,5,32,64]{1,0,2,3} %copy.94), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %constant_206 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.141 = f32[] parameter(0)
  %subtract.98 = f32[] subtract(f32[] %constant_206, f32[] %param_0.141), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.262 = f32[5,5,32,64]{1,0,2,3} broadcast(f32[] %subtract.98), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %multiply.83 = f32[5,5,32,64]{1,0,2,3} multiply(f32[5,5,32,64]{1,0,2,3} %subtract.99, f32[5,5,32,64]{1,0,2,3} %broadcast.262), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %add.61 = f32[5,5,32,64]{1,0,2,3} add(f32[5,5,32,64]{1,0,2,3} %copy.94, f32[5,5,32,64]{1,0,2,3} %multiply.83), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %copy.92 = f32[5,5,32,64]{3,2,1,0} copy(f32[5,5,32,64]{1,0,2,3} %add.61), metadata={op_name="XLA_Retvals"}
  %param_6.105 = f32[5,5,32,64]{3,2,1,0} parameter(6)
  %copy.73.clone.1 = f32[5,5,32,64]{1,0,2,3} copy(f32[5,5,32,64]{3,2,1,0} %param_6.105), metadata={op_name="XLA_Args"}
  %param_5.120 = f32[] parameter(5)
  %broadcast.23.clone.1 = f32[5,5,32,64]{1,0,2,3} broadcast(f32[] %param_5.120), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %multiply.24.clone.1 = f32[5,5,32,64]{1,0,2,3} multiply(f32[5,5,32,64]{1,0,2,3} %add.61, f32[5,5,32,64]{1,0,2,3} %broadcast.23.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %param_4.117 = f32[5,5,32,64]{3,2,1,0} parameter(4)
  %copy.86.clone.1 = f32[5,5,32,64]{1,0,2,3} copy(f32[5,5,32,64]{3,2,1,0} %param_4.117), metadata={op_name="XLA_Args"}
  %multiply.75.clone.1 = f32[5,5,32,64]{1,0,2,3} multiply(f32[5,5,32,64]{1,0,2,3} %param_1.230, f32[5,5,32,64]{1,0,2,3} %param_1.230), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %subtract.87.clone.1 = f32[5,5,32,64]{1,0,2,3} subtract(f32[5,5,32,64]{1,0,2,3} %multiply.75.clone.1, f32[5,5,32,64]{1,0,2,3} %copy.86.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %param_3.149 = f32[] parameter(3)
  %subtract.86.clone.1 = f32[] subtract(f32[] %constant_206, f32[] %param_3.149), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.255.clone.1 = f32[5,5,32,64]{1,0,2,3} broadcast(f32[] %subtract.86.clone.1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %multiply.74.clone.1 = f32[5,5,32,64]{1,0,2,3} multiply(f32[5,5,32,64]{1,0,2,3} %subtract.87.clone.1, f32[5,5,32,64]{1,0,2,3} %broadcast.255.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %add.54.clone.1 = f32[5,5,32,64]{1,0,2,3} add(f32[5,5,32,64]{1,0,2,3} %copy.86.clone.1, f32[5,5,32,64]{1,0,2,3} %multiply.74.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %sqrt.6.clone.1 = f32[5,5,32,64]{1,0,2,3} sqrt(f32[5,5,32,64]{1,0,2,3} %add.54.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %constant_34_clone_1 = f32[] constant(1e-07), metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %broadcast.22.clone.1 = f32[5,5,32,64]{1,0,2,3} broadcast(f32[] %constant_34_clone_1), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %add.19.clone.1 = f32[5,5,32,64]{1,0,2,3} add(f32[5,5,32,64]{1,0,2,3} %sqrt.6.clone.1, f32[5,5,32,64]{1,0,2,3} %broadcast.22.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %divide.7.clone.1 = f32[5,5,32,64]{1,0,2,3} divide(f32[5,5,32,64]{1,0,2,3} %multiply.24.clone.1, f32[5,5,32,64]{1,0,2,3} %add.19.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %subtract.19.clone.1 = f32[5,5,32,64]{1,0,2,3} subtract(f32[5,5,32,64]{1,0,2,3} %copy.73.clone.1, f32[5,5,32,64]{1,0,2,3} %divide.7.clone.1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_2/ResourceApplyAdam"}
  %copy.65.clone.1 = f32[5,5,32,64]{3,2,1,0} copy(f32[5,5,32,64]{1,0,2,3} %subtract.19.clone.1), metadata={op_name="XLA_Retvals"}
  %copy.87.clone.1 = f32[5,5,32,64]{3,2,1,0} copy(f32[5,5,32,64]{1,0,2,3} %add.54.clone.1), metadata={op_name="XLA_Retvals"}
  ROOT %tuple.23 = (f32[5,5,32,64]{3,2,1,0}, f32[5,5,32,64]{3,2,1,0}, f32[5,5,32,64]{3,2,1,0}) tuple(f32[5,5,32,64]{3,2,1,0} %copy.92, f32[5,5,32,64]{3,2,1,0} %copy.65.clone.1, f32[5,5,32,64]{3,2,1,0} %copy.87.clone.1)
}

%fused_computation.55 (param_0.153: f32[], param_1.244: f32[5,5,64,128], param_2.281: f32[5,5,64,128], param_3.144: f32[], param_4.109: f32[5,5,64,128], param_5.107: f32[], param_6.92: f32[5,5,64,128]) -> (f32[5,5,64,128], f32[5,5,64,128], f32[5,5,64,128]) {
  %param_2.281 = f32[5,5,64,128]{3,2,1,0} parameter(2)
  %copy.104 = f32[5,5,64,128]{1,0,2,3} copy(f32[5,5,64,128]{3,2,1,0} %param_2.281), metadata={op_name="XLA_Args"}
  %param_1.244 = f32[5,5,64,128]{1,0,2,3} parameter(1)
  %subtract.115 = f32[5,5,64,128]{1,0,2,3} subtract(f32[5,5,64,128]{1,0,2,3} %param_1.244, f32[5,5,64,128]{1,0,2,3} %copy.104), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/ResourceApplyAdam"}
  %constant_219 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %param_0.153 = f32[] parameter(0)
  %subtract.114 = f32[] subtract(f32[] %constant_219, f32[] %param_0.153), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.270 = f32[5,5,64,128]{1,0,2,3} broadcast(f32[] %subtract.114), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/ResourceApplyAdam"}
  %multiply.95 = f32[5,5,64,128]{1,0,2,3} multiply(f32[5,5,64,128]{1,0,2,3} %subtract.115, f32[5,5,64,128]{1,0,2,3} %broadcast.270), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/ResourceApplyAdam"}
  %add.70 = f32[5,5,64,128]{1,0,2,3} add(f32[5,5,64,128]{1,0,2,3} %copy.104, f32[5,5,64,128]{1,0,2,3} %multiply.95), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_4/ResourceApplyAdam"}
  %copy.102 = f32[5,5,64,128]{3,2,1,0} copy(f32[5,5,64,128]{1,0,2,3} %add.70), metadata={op_name="XLA_Retvals"}
  %param_6.92 = f32[5,5,64,128]{3,2,1,0} parameter(6)
  %copy.72.clone.1 = f32[5,5,64,128]{1,0,2,3} copy(f32[5,5,64,128]{3,2,1,0} %param_6.92), metadata={op_name="XLA_Args"}
  %param_5.107 = f32[] parameter(5)
