HloModule cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_6__XlaNumResourceArgs_34_.612

%max_F32.62 (lhs.63: f32[], rhs.64: f32[]) -> f32[] {
  %lhs.63 = f32[] parameter(0)
  %rhs.64 = f32[] parameter(1)
  ROOT %maximum.65 = f32[] maximum(f32[] %lhs.63, f32[] %rhs.64)
}

%max_float_.125 (x.126: f32[], y.127: f32[]) -> f32[] {
  %x.126 = f32[] parameter(0)
  %y.127 = f32[] parameter(1)
  ROOT %maximum.128 = f32[] maximum(f32[] %x.126, f32[] %y.127)
}

%add_float_.135 (x.136: f32[], y.137: f32[]) -> f32[] {
  %x.136 = f32[] parameter(0)
  %y.137 = f32[] parameter(1)
  ROOT %add.138 = f32[] add(f32[] %x.136, f32[] %y.137)
}

%add_float_.148 (x.149: f32[], y.150: f32[]) -> f32[] {
  %x.149 = f32[] parameter(0)
  %y.150 = f32[] parameter(1)
  ROOT %add.151 = f32[] add(f32[] %x.149, f32[] %y.150)
}

%PartitionedCall_gradients_mnist_classifier_StatefulPartitionedCall_grad_PartitionedCall_gradients_dense_1_Softmax_grad_Sum-reduction.170 (x.171: f32[], y.172: f32[]) -> f32[] {
  %x.171 = f32[] parameter(0)
  %y.172 = f32[] parameter(1)
  ROOT %add.173 = f32[] add(f32[] %x.171, f32[] %y.172)
}

%add_float_.183 (x.184: f32[], y.185: f32[]) -> f32[] {
  %x.184 = f32[] parameter(0)
  %y.185 = f32[] parameter(1)
  ROOT %add.186 = f32[] add(f32[] %x.184, f32[] %y.185)
}

%add_float_.222 (x.223: f32[], y.224: f32[]) -> f32[] {
  %x.223 = f32[] parameter(0)
  %y.224 = f32[] parameter(1)
  ROOT %add.225 = f32[] add(f32[] %x.223, f32[] %y.224)
}

%add_float_.263 (x.264: f32[], y.265: f32[]) -> f32[] {
  %x.264 = f32[] parameter(0)
  %y.265 = f32[] parameter(1)
  ROOT %add.266 = f32[] add(f32[] %x.264, f32[] %y.265)
}

%max_F32.323 (lhs.324: f32[], rhs.325: f32[]) -> f32[] {
  %lhs.324 = f32[] parameter(0)
  %rhs.325 = f32[] parameter(1)
  ROOT %maximum.326 = f32[] maximum(f32[] %lhs.324, f32[] %rhs.325)
}

%ge_F32.329 (lhs.330: f32[], rhs.331: f32[]) -> pred[] {
  %lhs.330 = f32[] parameter(0)
  %rhs.331 = f32[] parameter(1)
  ROOT %compare.332 = pred[] compare(f32[] %lhs.330, f32[] %rhs.331), direction=GE
}

%add_F32.333 (lhs.334: f32[], rhs.335: f32[]) -> f32[] {
  %lhs.334 = f32[] parameter(0)
  %rhs.335 = f32[] parameter(1)
  ROOT %add.336 = f32[] add(f32[] %lhs.334, f32[] %rhs.335)
}

%add_float_.344 (x.345: f32[], y.346: f32[]) -> f32[] {
  %x.345 = f32[] parameter(0)
  %y.346 = f32[] parameter(1)
  ROOT %add.347 = f32[] add(f32[] %x.345, f32[] %y.346)
}

%add_float_.409 (x.410: f32[], y.411: f32[]) -> f32[] {
  %x.410 = f32[] parameter(0)
  %y.411 = f32[] parameter(1)
  ROOT %add.412 = f32[] add(f32[] %x.410, f32[] %y.411)
}

ENTRY %cluster_0__XlaCompiledKernel_true__XlaHasReferenceVars_false__XlaNumConstantArgs_6__XlaNumResourceArgs_34_.612 (arg0.1: s32[1024], arg1.2: f32[1024,28,28,1], arg2.3: s64[], arg3.4: f32[], arg4.5: f32[], arg5.6: f32[], arg6.7: f32[32], arg7.8: f32[5,5,1,32], arg8.9: f32[64], arg9.10: f32[5,5,32,64], arg10.11: f32[128], arg11.12: f32[5,5,64,128], arg12.13: f32[128], arg13.14: f32[4608,128], arg14.15: f32[10], arg15.16: f32[128,10], arg16.17: f32[10], arg17.18: f32[10], arg18.19: f32[128,10], arg19.20: f32[128,10], arg20.21: f32[4608,128], arg21.22: f32[4608,128], arg22.23: f32[128], arg23.24: f32[128], arg24.25: f32[5,5,64,128], arg25.26: f32[5,5,64,128], arg26.27: f32[128], arg27.28: f32[128], arg28.29: f32[5,5,32,64], arg29.30: f32[5,5,32,64], arg30.31: f32[64], arg31.32: f32[64], arg32.33: f32[5,5,1,32], arg33.34: f32[5,5,1,32], arg34.35: f32[32], arg35.36: f32[32]) -> (f32[1024], f32[32], f32[5,5,1,32], f32[64], f32[5,5,32,64], f32[128], f32[5,5,64,128], f32[128], f32[4608,128], f32[10], f32[128,10], f32[10], f32[10], f32[128,10], f32[128,10], f32[4608,128], f32[4608,128], f32[128], f32[128], f32[5,5,64,128], f32[5,5,64,128], f32[128], f32[128], f32[5,5,32,64], f32[5,5,32,64], f32[64], f32[64], f32[5,5,1,32], f32[5,5,1,32], f32[32], f32[32]) {
  %constant.58 = f32[] constant(0), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Relu"}
  %broadcast.59 = f32[1024,64,20,20]{3,2,1,0} broadcast(f32[] %constant.58), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Relu"}
  %constant.52 = f32[] constant(0), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"}
  %broadcast.53 = f32[1024,32,24,24]{3,2,1,0} broadcast(f32[] %constant.52), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"}
  %arg1.2 = f32[1024,28,28,1]{3,2,1,0} parameter(1), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.38 = f32[1024,28,28,1]{3,2,1,0} reshape(f32[1024,28,28,1]{3,2,1,0} %arg1.2)
  %transpose.48 = f32[1024,1,28,28]{1,3,2,0} transpose(f32[1024,28,28,1]{3,2,1,0} %reshape.38), dimensions={0,3,1,2}, metadata={op_type="Transpose" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-TransposeNHWCToNCHW-LayoutOptimizer"}
  %arg7.8 = f32[5,5,1,32]{3,2,1,0} parameter(7), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.49 = f32[1024,32,24,24]{3,2,1,0} convolution(f32[1024,1,28,28]{1,3,2,0} %transpose.48, f32[5,5,1,32]{3,2,1,0} %arg7.8), window={size=5x5}, dim_labels=bf01_01io->bf01, metadata={op_type="Conv2D" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D"}
  %arg6.7 = f32[32]{0} parameter(6), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %broadcast.50 = f32[1024,32,24,24]{3,2,1,0} broadcast(f32[32]{0} %arg6.7), dimensions={1}, metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd"}
  %add.51 = f32[1024,32,24,24]{3,2,1,0} add(f32[1024,32,24,24]{3,2,1,0} %convolution.49, f32[1024,32,24,24]{3,2,1,0} %broadcast.50), metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd"}
  %maximum.54 = f32[1024,32,24,24]{3,2,1,0} maximum(f32[1024,32,24,24]{3,2,1,0} %broadcast.53, f32[1024,32,24,24]{3,2,1,0} %add.51), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"}
  %arg9.10 = f32[5,5,32,64]{3,2,1,0} parameter(9), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.55 = f32[1024,64,20,20]{3,2,1,0} convolution(f32[1024,32,24,24]{3,2,1,0} %maximum.54, f32[5,5,32,64]{3,2,1,0} %arg9.10), window={size=5x5}, dim_labels=bf01_01io->bf01, metadata={op_type="Conv2D" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D"}
  %arg8.9 = f32[64]{0} parameter(8), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %broadcast.56 = f32[1024,64,20,20]{3,2,1,0} broadcast(f32[64]{0} %arg8.9), dimensions={1}, metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd"}
  %add.57 = f32[1024,64,20,20]{3,2,1,0} add(f32[1024,64,20,20]{3,2,1,0} %convolution.55, f32[1024,64,20,20]{3,2,1,0} %broadcast.56), metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd"}
  %maximum.60 = f32[1024,64,20,20]{3,2,1,0} maximum(f32[1024,64,20,20]{3,2,1,0} %broadcast.59, f32[1024,64,20,20]{3,2,1,0} %add.57), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Relu"}
  %constant.322 = f32[] constant(-inf), metadata={op_type="MaxPoolGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/max_pooling2d/MaxPool_grad/MaxPoolGrad"}
  %reduce-window.327 = f32[1024,64,10,10]{3,2,1,0} reduce-window(f32[1024,64,20,20]{3,2,1,0} %maximum.60, f32[] %constant.322), window={size=1x1x2x2 stride=1x1x2x2}, to_apply=%max_F32.323, metadata={op_type="MaxPoolGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/max_pooling2d/MaxPool_grad/MaxPoolGrad"}
  %arg0.1 = s32[1024]{0} parameter(0), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %reshape.37 = s32[1024]{0} reshape(s32[1024]{0} %arg0.1)
  %convert.100 = f32[1024]{0} convert(s32[1024]{0} %reshape.37), metadata={op_type="Cast" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast"}
  %convert.101 = s64[1024]{0} convert(f32[1024]{0} %convert.100), metadata={op_type="Cast" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast_1"}
  %broadcast.107 = s64[1024,10]{1,0} broadcast(s64[1024]{0} %convert.101), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %iota.106 = s64[1024,10]{1,0} iota(), iota_dimension=1, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.108 = pred[1024,10]{1,0} compare(s64[1024,10]{1,0} %broadcast.107, s64[1024,10]{1,0} %iota.106), direction=EQ, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.103 = f32[] constant(1), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.105 = f32[1024,10]{1,0} broadcast(f32[] %constant.103), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.102 = f32[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.104 = f32[1024,10]{1,0} broadcast(f32[] %constant.102), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.109 = f32[1024,10]{1,0} select(pred[1024,10]{1,0} %compare.108, f32[1024,10]{1,0} %broadcast.105, f32[1024,10]{1,0} %broadcast.104), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.117 = s64[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.118 = s64[1024]{0} broadcast(s64[] %constant.117), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.119 = pred[1024]{0} compare(s64[1024]{0} %broadcast.118, s64[1024]{0} %convert.101), direction=LE, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.114 = s64[] constant(10), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.115 = s64[1024]{0} broadcast(s64[] %constant.114), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %compare.116 = pred[1024]{0} compare(s64[1024]{0} %convert.101, s64[1024]{0} %broadcast.115), direction=LT, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %and.120 = pred[1024]{0} and(pred[1024]{0} %compare.119, pred[1024]{0} %compare.116), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.112 = f32[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.113 = f32[1024]{0} broadcast(f32[] %constant.112), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.110 = f32[] constant(nan), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.111 = f32[1024]{0} broadcast(f32[] %constant.110), dimensions={}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %select.121 = f32[1024]{0} select(pred[1024]{0} %and.120, f32[1024]{0} %broadcast.113, f32[1024]{0} %broadcast.111), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.122 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %select.121), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %add.123 = f32[1024,10]{1,0} add(f32[1024,10]{1,0} %select.109, f32[1024,10]{1,0} %broadcast.122), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %negate.144 = f32[1024,10]{1,0} negate(f32[1024,10]{1,0} %add.123), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.79 = f32[] constant(0), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"}
  %broadcast.80 = f32[1024,128]{1,0} broadcast(f32[] %constant.79), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"}
  %constant.70 = f32[] constant(0), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu"}
  %broadcast.71 = f32[1024,128,6,6]{3,2,1,0} broadcast(f32[] %constant.70), dimensions={}, metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu"}
  %constant.61 = f32[] constant(-inf), metadata={op_type="MaxPool" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/max_pooling2d/MaxPool"}
  %reduce-window.66 = f32[1024,64,10,10]{3,2,1,0} reduce-window(f32[1024,64,20,20]{3,2,1,0} %maximum.60, f32[] %constant.61), window={size=1x1x2x2 stride=1x1x2x2}, to_apply=%max_F32.62, metadata={op_type="MaxPool" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/max_pooling2d/MaxPool"}
  %arg11.12 = f32[5,5,64,128]{3,2,1,0} parameter(11), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %convolution.67 = f32[1024,128,6,6]{3,2,1,0} convolution(f32[1024,64,10,10]{3,2,1,0} %reduce-window.66, f32[5,5,64,128]{3,2,1,0} %arg11.12), window={size=5x5}, dim_labels=bf01_01io->bf01, metadata={op_type="Conv2D" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D"}
  %arg10.11 = f32[128]{0} parameter(10), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %broadcast.68 = f32[1024,128,6,6]{3,2,1,0} broadcast(f32[128]{0} %arg10.11), dimensions={1}, metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd"}
  %add.69 = f32[1024,128,6,6]{3,2,1,0} add(f32[1024,128,6,6]{3,2,1,0} %convolution.67, f32[1024,128,6,6]{3,2,1,0} %broadcast.68), metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd"}
  %maximum.72 = f32[1024,128,6,6]{3,2,1,0} maximum(f32[1024,128,6,6]{3,2,1,0} %broadcast.71, f32[1024,128,6,6]{3,2,1,0} %add.69), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu"}
  %transpose.73 = f32[1024,6,6,128]{2,1,3,0} transpose(f32[1024,128,6,6]{3,2,1,0} %maximum.72), dimensions={0,2,3,1}, metadata={op_type="Transpose" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu-0-1-TransposeNCHWToNHWC-LayoutOptimizer"}
  %reshape.74 = f32[1024,4608]{1,0} reshape(f32[1024,6,6,128]{2,1,3,0} %transpose.73), metadata={op_type="Reshape" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/flatten/Reshape"}
  %arg13.14 = f32[4608,128]{1,0} parameter(13), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %dot.75 = f32[1024,128]{1,0} dot(f32[1024,4608]{1,0} %reshape.74, f32[4608,128]{1,0} %arg13.14), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_type="MatMul" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul"}
  %transpose.76 = f32[1024,128]{1,0} transpose(f32[1024,128]{1,0} %dot.75), dimensions={0,1}, metadata={op_type="MatMul" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul"}
  %arg12.13 = f32[128]{0} parameter(12), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %broadcast.77 = f32[1024,128]{1,0} broadcast(f32[128]{0} %arg12.13), dimensions={1}, metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd"}
  %add.78 = f32[1024,128]{1,0} add(f32[1024,128]{1,0} %transpose.76, f32[1024,128]{1,0} %broadcast.77), metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd"}
  %maximum.81 = f32[1024,128]{1,0} maximum(f32[1024,128]{1,0} %broadcast.80, f32[1024,128]{1,0} %add.78), metadata={op_type="Relu" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"}
  %arg15.16 = f32[128,10]{1,0} parameter(15), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %dot.82 = f32[1024,10]{1,0} dot(f32[1024,128]{1,0} %maximum.81, f32[128,10]{1,0} %arg15.16), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_type="MatMul" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul"}
  %transpose.83 = f32[1024,10]{1,0} transpose(f32[1024,10]{1,0} %dot.82), dimensions={0,1}, metadata={op_type="MatMul" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul"}
  %arg14.15 = f32[10]{0} parameter(14), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %broadcast.84 = f32[1024,10]{1,0} broadcast(f32[10]{0} %arg14.15), dimensions={1}, metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd"}
  %add.85 = f32[1024,10]{1,0} add(f32[1024,10]{1,0} %transpose.83, f32[1024,10]{1,0} %broadcast.84), metadata={op_type="BiasAdd" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd"}
  %softmax.86 = f32[1024,10]{1,0} softmax(f32[1024,10]{1,0} %add.85), feature_index=1, log=false, metadata={op_type="Softmax" op_name="StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"}
  %constant.90 = f32[] constant(0.999999881), metadata={op_type="Minimum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"}
  %broadcast.91 = f32[1024,10]{1,0} broadcast(f32[] %constant.90), dimensions={}, metadata={op_type="Minimum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"}
  %minimum.92 = f32[1024,10]{1,0} minimum(f32[1024,10]{1,0} %softmax.86, f32[1024,10]{1,0} %broadcast.91), metadata={op_type="Minimum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"}
  %constant.96 = f32[] constant(1e-07), metadata={op_type="Maximum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"}
  %broadcast.97 = f32[1024,10]{1,0} broadcast(f32[] %constant.96), dimensions={}, metadata={op_type="Maximum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"}
  %maximum.98 = f32[1024,10]{1,0} maximum(f32[1024,10]{1,0} %minimum.92, f32[1024,10]{1,0} %broadcast.97), metadata={op_type="Maximum" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"}
  %log.99 = f32[1024,10]{1,0} log(f32[1024,10]{1,0} %maximum.98), metadata={op_type="Log" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Log"}
  %constant.124 = f32[] constant(-inf), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %reduce.129 = f32[1024]{0} reduce(f32[1024,10]{1,0} %log.99, f32[] %constant.124), dimensions={1}, to_apply=%max_float_.125, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.130 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %reduce.129), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.131 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %log.99, f32[1024,10]{1,0} %broadcast.130), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %exponential.132 = f32[1024,10]{1,0} exponential(f32[1024,10]{1,0} %subtract.131), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %convert.133 = f32[1024,10]{1,0} convert(f32[1024,10]{1,0} %exponential.132), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.134 = f32[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %reduce.139 = f32[1024]{0} reduce(f32[1024,10]{1,0} %convert.133, f32[] %constant.134), dimensions={1}, to_apply=%add_float_.135, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %convert.140 = f32[1024]{0} convert(f32[1024]{0} %reduce.139), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %log.141 = f32[1024]{0} log(f32[1024]{0} %convert.140), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %broadcast.142 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %log.141), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.143 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %subtract.131, f32[1024,10]{1,0} %broadcast.142), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.145 = f32[1024,10]{1,0} multiply(f32[1024,10]{1,0} %negate.144, f32[1024,10]{1,0} %subtract.143), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %convert.147 = f32[1024,10]{1,0} convert(f32[1024,10]{1,0} %multiply.145), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %constant.146 = f32[] constant(0), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %reduce.152 = f32[1024]{0} reduce(f32[1024,10]{1,0} %convert.147, f32[] %constant.146), dimensions={1}, to_apply=%add_float_.148, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %convert.153 = f32[1024]{0} convert(f32[1024]{0} %reduce.152), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %reshape.520 = f32[1024]{0} reshape(f32[1024]{0} %convert.153), metadata={op_name="XLA_Retvals"}
  %arg34.35 = f32[32]{0} parameter(34), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %constant.403 = f32[] constant(0), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Relu_grad/ReluGrad"}
  %broadcast.404 = f32[1024,32,24,24]{3,2,1,0} broadcast(f32[] %constant.403), dimensions={}, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Relu_grad/ReluGrad"}
  %compare.405 = pred[1024,32,24,24]{3,2,1,0} compare(f32[1024,32,24,24]{3,2,1,0} %maximum.54, f32[1024,32,24,24]{3,2,1,0} %broadcast.404), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Relu_grad/ReluGrad"}
  %constant.338 = f32[] constant(0), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Relu_grad/ReluGrad"}
  %broadcast.339 = f32[1024,64,20,20]{3,2,1,0} broadcast(f32[] %constant.338), dimensions={}, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Relu_grad/ReluGrad"}
  %compare.340 = pred[1024,64,20,20]{3,2,1,0} compare(f32[1024,64,20,20]{3,2,1,0} %maximum.60, f32[1024,64,20,20]{3,2,1,0} %broadcast.339), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Relu_grad/ReluGrad"}
  %constant.257 = f32[] constant(0), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad"}
  %broadcast.258 = f32[1024,128,6,6]{3,2,1,0} broadcast(f32[] %constant.257), dimensions={}, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad"}
  %compare.259 = pred[1024,128,6,6]{3,2,1,0} compare(f32[1024,128,6,6]{3,2,1,0} %maximum.72, f32[1024,128,6,6]{3,2,1,0} %broadcast.258), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad"}
  %constant.216 = f32[] constant(0), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense/Relu_grad/ReluGrad"}
  %broadcast.217 = f32[1024,128]{1,0} broadcast(f32[] %constant.216), dimensions={}, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense/Relu_grad/ReluGrad"}
  %compare.218 = pred[1024,128]{1,0} compare(f32[1024,128]{1,0} %maximum.81, f32[1024,128]{1,0} %broadcast.217), direction=GT, metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense/Relu_grad/ReluGrad"}
  %constant.87 = f32[] constant(0.999999881), metadata={op_type="LessEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value/Minimum_grad/LessEqual"}
  %broadcast.88 = f32[1024,10]{1,0} broadcast(f32[] %constant.87), dimensions={}, metadata={op_type="LessEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value/Minimum_grad/LessEqual"}
  %compare.89 = pred[1024,10]{1,0} compare(f32[1024,10]{1,0} %softmax.86, f32[1024,10]{1,0} %broadcast.88), direction=LE, metadata={op_type="LessEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value/Minimum_grad/LessEqual"}
  %constant.93 = f32[] constant(1e-07), metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %broadcast.94 = f32[1024,10]{1,0} broadcast(f32[] %constant.93), dimensions={}, metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %compare.95 = pred[1024,10]{1,0} compare(f32[1024,10]{1,0} %minimum.92, f32[1024,10]{1,0} %broadcast.94), direction=GE, metadata={op_type="GreaterEqual" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"}
  %constant.160 = f32[] constant(1), metadata={op_type="Reciprocal" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/Log_grad/Reciprocal"}
  %broadcast.161 = f32[1024,10]{1,0} broadcast(f32[] %constant.160), dimensions={}, metadata={op_type="Reciprocal" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/Log_grad/Reciprocal"}
  %divide.162 = f32[1024,10]{1,0} divide(f32[1024,10]{1,0} %broadcast.161, f32[1024,10]{1,0} %maximum.98), metadata={op_type="Reciprocal" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/Log_grad/Reciprocal"}
  %constant.39 = f32[] constant(0.0009765625), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims"}
  %broadcast.40 = f32[1024,1]{1,0} broadcast(f32[] %constant.39), dimensions={}, metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims"}
  %reshape.157 = f32[1024]{0} reshape(f32[1024,1]{1,0} %broadcast.40), metadata={op_type="Mul" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/mul"}
  %broadcast.158 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %reshape.157), dimensions={0}, metadata={op_type="Mul" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/mul"}
  %broadcast.154 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %convert.140), dimensions={0}, metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %divide.155 = f32[1024,10]{1,0} divide(f32[1024,10]{1,0} %exponential.132, f32[1024,10]{1,0} %broadcast.154), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %subtract.156 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %divide.155, f32[1024,10]{1,0} %add.123), metadata={op_type="SparseSoftmaxCrossEntropyWithLogits" op_name="StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"}
  %multiply.159 = f32[1024,10]{1,0} multiply(f32[1024,10]{1,0} %broadcast.158, f32[1024,10]{1,0} %subtract.156), metadata={op_type="Mul" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/mul"}
  %multiply.163 = f32[1024,10]{1,0} multiply(f32[1024,10]{1,0} %divide.162, f32[1024,10]{1,0} %multiply.159), metadata={op_type="Mul" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/Log_grad/mul"}
  %constant.41 = f32[] constant(0), metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %broadcast.42 = f32[1024,10]{1,0} broadcast(f32[] %constant.41), dimensions={}, metadata={op_type="Const" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"}
  %select.164 = f32[1024,10]{1,0} select(pred[1024,10]{1,0} %compare.95, f32[1024,10]{1,0} %multiply.163, f32[1024,10]{1,0} %broadcast.42), metadata={op_type="SelectV2" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/SelectV2"}
  %select.165 = f32[1024,10]{1,0} select(pred[1024,10]{1,0} %compare.89, f32[1024,10]{1,0} %select.164, f32[1024,10]{1,0} %broadcast.42), metadata={op_type="SelectV2" op_name="PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value/Minimum_grad/SelectV2"}
  %multiply.166 = f32[1024,10]{1,0} multiply(f32[1024,10]{1,0} %select.165, f32[1024,10]{1,0} %softmax.86), metadata={op_type="Mul" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/mul"}
  %convert.167 = f32[1024,10]{1,0} convert(f32[1024,10]{1,0} %multiply.166), metadata={op_type="Sum" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/Sum"}
  %constant.168 = f32[] constant(0), metadata={op_type="Sum" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/Sum"}
  %convert.169 = f32[] convert(f32[] %constant.168), metadata={op_type="Sum" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/Sum"}
  %reduce.174 = f32[1024]{0} reduce(f32[1024,10]{1,0} %convert.167, f32[] %convert.169), dimensions={1}, to_apply=%PartitionedCall_gradients_mnist_classifier_StatefulPartitionedCall_grad_PartitionedCall_gradients_dense_1_Softmax_grad_Sum-reduction.170, metadata={op_type="Sum" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/Sum"}
  %convert.175 = f32[1024]{0} convert(f32[1024]{0} %reduce.174), metadata={op_type="Sum" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/Sum"}
  %reshape.176 = f32[1024,1]{1,0} reshape(f32[1024]{0} %convert.175), metadata={op_type="Sum" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/Sum"}
  %reshape.177 = f32[1024]{0} reshape(f32[1024,1]{1,0} %reshape.176), metadata={op_type="Sub" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/sub"}
  %broadcast.178 = f32[1024,10]{1,0} broadcast(f32[1024]{0} %reshape.177), dimensions={0}, metadata={op_type="Sub" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/sub"}
  %subtract.179 = f32[1024,10]{1,0} subtract(f32[1024,10]{1,0} %select.165, f32[1024,10]{1,0} %broadcast.178), metadata={op_type="Sub" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/sub"}
  %multiply.180 = f32[1024,10]{1,0} multiply(f32[1024,10]{1,0} %subtract.179, f32[1024,10]{1,0} %softmax.86), metadata={op_type="Mul" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/Softmax_grad/mul_1"}
  %dot.214 = f32[1024,128]{1,0} dot(f32[1024,10]{1,0} %multiply.180, f32[128,10]{1,0} %arg15.16), lhs_contracting_dims={1}, rhs_contracting_dims={1}, metadata={op_type="MatMul" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/MatMul_grad/MatMul"}
  %transpose.215 = f32[1024,128]{1,0} transpose(f32[1024,128]{1,0} %dot.214), dimensions={0,1}, metadata={op_type="MatMul" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense_1/MatMul_grad/MatMul"}
  %select.219 = f32[1024,128]{1,0} select(pred[1024,128]{1,0} %compare.218, f32[1024,128]{1,0} %transpose.215, f32[1024,128]{1,0} %broadcast.217), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense/Relu_grad/ReluGrad"}
  %dot.253 = f32[1024,4608]{1,0} dot(f32[1024,128]{1,0} %select.219, f32[4608,128]{1,0} %arg13.14), lhs_contracting_dims={1}, rhs_contracting_dims={1}, metadata={op_type="MatMul" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense/MatMul_grad/MatMul"}
  %transpose.254 = f32[1024,4608]{1,0} transpose(f32[1024,4608]{1,0} %dot.253), dimensions={0,1}, metadata={op_type="MatMul" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/dense/MatMul_grad/MatMul"}
  %reshape.255 = f32[1024,6,6,128]{3,2,1,0} reshape(f32[1024,4608]{1,0} %transpose.254), metadata={op_type="Reshape" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/flatten/Reshape_grad/Reshape"}
  %transpose.256 = f32[1024,128,6,6]{1,3,2,0} transpose(f32[1024,6,6,128]{3,2,1,0} %reshape.255), dimensions={0,3,1,2}, metadata={op_type="Transpose" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad-0-TransposeNHWCToNCHW-LayoutOptimizer"}
  %select.260 = f32[1024,128,6,6]{3,2,1,0} select(pred[1024,128,6,6]{3,2,1,0} %compare.259, f32[1024,128,6,6]{1,3,2,0} %transpose.256, f32[1024,128,6,6]{3,2,1,0} %broadcast.258), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Relu_grad/ReluGrad"}
  %reverse.320 = f32[5,5,64,128]{3,2,1,0} reverse(f32[5,5,64,128]{3,2,1,0} %arg11.12), dimensions={0,1}, metadata={op_type="Conv2DBackpropInput" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Conv2D_grad/Conv2DBackpropInput"}
  %convolution.321 = f32[1024,64,10,10]{3,2,1,0} convolution(f32[1024,128,6,6]{3,2,1,0} %select.260, f32[5,5,64,128]{3,2,1,0} %reverse.320), window={size=5x5 pad=4_4x4_4}, dim_labels=bf01_01oi->bf01, metadata={op_type="Conv2DBackpropInput" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Conv2D_grad/Conv2DBackpropInput"}
  %constant.328 = f32[] constant(0), metadata={op_type="MaxPoolGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/max_pooling2d/MaxPool_grad/MaxPoolGrad"}
  %select-and-scatter.337 = f32[1024,64,20,20]{3,2,1,0} select-and-scatter(f32[1024,64,20,20]{3,2,1,0} %maximum.60, f32[1024,64,10,10]{3,2,1,0} %convolution.321, f32[] %constant.328), window={size=1x1x2x2 stride=1x1x2x2}, select=%ge_F32.329, scatter=%add_F32.333, metadata={op_type="MaxPoolGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/max_pooling2d/MaxPool_grad/MaxPoolGrad"}
  %select.341 = f32[1024,64,20,20]{3,2,1,0} select(pred[1024,64,20,20]{3,2,1,0} %compare.340, f32[1024,64,20,20]{3,2,1,0} %select-and-scatter.337, f32[1024,64,20,20]{3,2,1,0} %broadcast.339), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Relu_grad/ReluGrad"}
  %reverse.401 = f32[5,5,32,64]{3,2,1,0} reverse(f32[5,5,32,64]{3,2,1,0} %arg9.10), dimensions={0,1}, metadata={op_type="Conv2DBackpropInput" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Conv2D_grad/Conv2DBackpropInput"}
  %convolution.402 = f32[1024,32,24,24]{3,2,1,0} convolution(f32[1024,64,20,20]{3,2,1,0} %select.341, f32[5,5,32,64]{3,2,1,0} %reverse.401), window={size=5x5 pad=4_4x4_4}, dim_labels=bf01_01oi->bf01, metadata={op_type="Conv2DBackpropInput" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Conv2D_grad/Conv2DBackpropInput"}
  %select.406 = f32[1024,32,24,24]{3,2,1,0} select(pred[1024,32,24,24]{3,2,1,0} %compare.405, f32[1024,32,24,24]{3,2,1,0} %convolution.402, f32[1024,32,24,24]{3,2,1,0} %broadcast.404), metadata={op_type="ReluGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Relu_grad/ReluGrad"}
  %convert.407 = f32[1024,32,24,24]{3,2,1,0} convert(f32[1024,32,24,24]{3,2,1,0} %select.406), metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/BiasAdd_grad/BiasAddGrad"}
  %constant.408 = f32[] constant(0), metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/BiasAdd_grad/BiasAddGrad"}
  %reduce.413 = f32[32]{0} reduce(f32[1024,32,24,24]{3,2,1,0} %convert.407, f32[] %constant.408), dimensions={0,2,3}, to_apply=%add_float_.409, metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/BiasAdd_grad/BiasAddGrad"}
  %convert.414 = f32[32]{0} convert(f32[32]{0} %reduce.413), metadata={op_type="BiasAddGrad" op_name="PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/BiasAdd_grad/BiasAddGrad"}
  %subtract.423 = f32[32]{0} subtract(f32[32]{0} %convert.414, f32[32]{0} %arg34.35), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %constant.416 = f32[] constant(1), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %arg4.5 = f32[] parameter(4), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %subtract.422 = f32[] subtract(f32[] %constant.416, f32[] %arg4.5), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.424 = f32[32]{0} broadcast(f32[] %subtract.422), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %multiply.425 = f32[32]{0} multiply(f32[32]{0} %subtract.423, f32[32]{0} %broadcast.424), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %add.426 = f32[32]{0} add(f32[32]{0} %arg34.35, f32[32]{0} %multiply.425), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %arg3.4 = f32[] parameter(3), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg5.6 = f32[] parameter(5), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %arg2.3 = s64[] parameter(2), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %constant.43 = s64[] constant(1), metadata={op_type="AddV2" op_name="Adam/add"}
  %add.44 = s64[] add(s64[] %arg2.3, s64[] %constant.43), metadata={op_type="AddV2" op_name="Adam/add"}
  %convert.45 = f32[] convert(s64[] %add.44), metadata={op_type="Cast" op_name="Adam/Cast_1"}
  %power.47 = f32[] power(f32[] %arg5.6, f32[] %convert.45), metadata={op_type="Pow" op_name="Adam/Pow_1"}
  %subtract.418 = f32[] subtract(f32[] %constant.416, f32[] %power.47), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %sqrt.419 = f32[] sqrt(f32[] %subtract.418), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %multiply.420 = f32[] multiply(f32[] %arg3.4, f32[] %sqrt.419), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %power.46 = f32[] power(f32[] %arg4.5, f32[] %convert.45), metadata={op_type="Pow" op_name="Adam/Pow"}
  %subtract.417 = f32[] subtract(f32[] %constant.416, f32[] %power.46), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %divide.421 = f32[] divide(f32[] %multiply.420, f32[] %subtract.417), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.436 = f32[32]{0} broadcast(f32[] %divide.421), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %multiply.437 = f32[32]{0} multiply(f32[32]{0} %add.426, f32[32]{0} %broadcast.436), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %arg35.36 = f32[32]{0} parameter(35), parameter_replication={false}, metadata={op_name="XLA_Args"}
  %multiply.428 = f32[32]{0} multiply(f32[32]{0} %convert.414, f32[32]{0} %convert.414), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %subtract.429 = f32[32]{0} subtract(f32[32]{0} %multiply.428, f32[32]{0} %arg35.36), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %subtract.427 = f32[] subtract(f32[] %constant.416, f32[] %arg5.6), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %broadcast.430 = f32[32]{0} broadcast(f32[] %subtract.427), dimensions={}, metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %multiply.431 = f32[32]{0} multiply(f32[32]{0} %subtract.429, f32[32]{0} %broadcast.430), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %add.432 = f32[32]{0} add(f32[32]{0} %arg35.36, f32[32]{0} %multiply.431), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
  %sqrt.433 = f32[32]{0} sqrt(f32[32]{0} %add.432), metadata={op_type="ResourceApplyAdam" op_name="Adam/Adam/update_1/ResourceApplyAdam"}
