node {
  name: "adam_adam_update_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 38
    }
  }
}
node {
  name: "adam_adam_update_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 39
    }
  }
}
node {
  name: "adam_adam_update_1_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 40
    }
  }
}
node {
  name: "adam_adam_update_1_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 41
    }
  }
}
node {
  name: "adam_adam_update_2_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 34
    }
  }
}
node {
  name: "adam_adam_update_2_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 35
    }
  }
}
node {
  name: "adam_adam_update_3_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 36
    }
  }
}
node {
  name: "adam_adam_update_3_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 37
    }
  }
}
node {
  name: "adam_adam_update_4_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 30
    }
  }
}
node {
  name: "adam_adam_update_4_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 31
    }
  }
}
node {
  name: "adam_adam_update_5_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 32
    }
  }
}
node {
  name: "adam_adam_update_5_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 33
    }
  }
}
node {
  name: "partitionedcall_gradients_mnist_classifier_statefulpartitionedcall_grad_partitionedcall_gradients_flatten_reshape_grad_shape_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -27
          }
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 3
    }
  }
}
node {
  name: "partitionedcall_gradients_mnist_classifier_statefulpartitionedcall_grad_partitionedcall_gradients_conv2d_conv2d_grad_conv2dbackpropfilter_0_permconstnhwctonchw_layoutoptimizer_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 4
    }
  }
}
node {
  name: "adam_adam_update_6_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 26
    }
  }
}
node {
  name: "adam_adam_update_6_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 27
    }
  }
}
node {
  name: "adam_adam_update_7_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 28
    }
  }
}
node {
  name: "adam_adam_update_7_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 29
    }
  }
}
node {
  name: "adam_adam_update_8_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 24
    }
  }
}
node {
  name: "adam_adam_update_8_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 25
    }
  }
}
node {
  name: "adam_adam_update_9_resourceapplyadam_m_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 22
    }
  }
}
node {
  name: "adam_adam_update_9_resourceapplyadam_v_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 23
    }
  }
}
node {
  name: "adam_readvariableop_resource_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 8
    }
  }
}
node {
  name: "Adam/add/y"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "adam_cast_readvariableop_resource_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 9
    }
  }
}
node {
  name: "adam_cast_2_readvariableop_resource_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 10
    }
  }
}
node {
  name: "adam_cast_3_readvariableop_resource_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 11
    }
  }
}
node {
  name: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0009765625
      }
    }
  }
}
node {
  name: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
          dim {
            size: 10
          }
        }
        float_val: 0
      }
    }
  }
}
node {
  name: "partitionedcall_gradients_partitionedcall_grad_partitionedcall_10_gradients_sparse_categorical_crossentropy_sparsesoftmaxcrossentropywithlogits_sparsesoftmaxcrossentropywithlogits_grad_expanddims_dim_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 2
    }
  }
}
node {
  name: "data_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 7
    }
  }
}
node {
  name: "partitionedcall_gradients_mnist_classifier_statefulpartitionedcall_grad_partitionedcall_gradients_conv2d_conv2d_grad_conv2dbackpropfilter_0_permconstnhwctonchw_layoutoptimizer_clone_0_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 5
    }
  }
}
node {
  name: "unknown_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 13
    }
  }
}
node {
  name: "unknown_0_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 12
    }
  }
}
node {
  name: "unknown_1_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 15
    }
  }
}
node {
  name: "unknown_2_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 14
    }
  }
}
node {
  name: "unknown_3_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 17
    }
  }
}
node {
  name: "unknown_4_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 16
    }
  }
}
node {
  name: "statefulpartitionedcall_mnist_classifier_statefulpartitionedcall_conv2d_2_relu_0_1_permconstnchwtonhwc_layoutoptimizer_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -28
          }
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
node {
  name: "statefulpartitionedcall_mnist_classifier_statefulpartitionedcall_flatten_const_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -29
          }
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 1
    }
  }
}
node {
  name: "unknown_5_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 19
    }
  }
}
node {
  name: "unknown_6_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 18
    }
  }
}
node {
  name: "unknown_7_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 21
    }
  }
}
node {
  name: "unknown_8_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 20
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/sub"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        tensor_content: "\376\377\177?"
      }
    }
  }
}
node {
  name: "Adam/Const"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1e-07
      }
    }
  }
}
node {
  name: "y_true_0_arg"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1024
          }
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 6
    }
  }
}
node {
  name: "Adam/ReadVariableOp"
  op: "ReadVariableOp"
  input: "adam_readvariableop_resource_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "Adam/Cast/ReadVariableOp"
  op: "ReadVariableOp"
  input: "adam_cast_readvariableop_resource_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Adam/Cast_2/ReadVariableOp"
  op: "ReadVariableOp"
  input: "adam_cast_2_readvariableop_resource_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Adam/Cast_3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "adam_cast_3_readvariableop_resource_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-TransposeNHWCToNCHW-LayoutOptimizer"
  op: "Transpose"
  input: "data_0_arg"
  input: "partitionedcall_gradients_mnist_classifier_statefulpartitionedcall_grad_partitionedcall_gradients_conv2d_conv2d_grad_conv2dbackpropfilter_0_permconstnhwctonchw_layoutoptimizer_clone_0_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_0_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_1_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_2_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_3_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_4_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_5_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_6_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_7_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unknown_8_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast"
  op: "Cast"
  input: "y_true_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "Adam/add"
  op: "AddV2"
  input: "Adam/ReadVariableOp"
  input: "Adam/add/y"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D"
  op: "Conv2D"
  input: "PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-TransposeNHWCToNCHW-LayoutOptimizer"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "ConstantFolding/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/ShapeN-matshapes-1"
  op: "Const"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\001\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "Func/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/output_control_node/_104"
  op: "NoOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast_1"
  op: "Cast"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "Adam/Cast_1"
  op: "Cast"
  input: "Adam/add"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "StatefulPartitionedCall"
  op: "NoOp"
  input: "^Func/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/output_control_node/_104"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "Adam/Pow"
  op: "Pow"
  input: "Adam/Cast_2/ReadVariableOp"
  input: "Adam/Cast_1"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "Adam/Pow_1"
  op: "Pow"
  input: "Adam/Cast_3/ReadVariableOp"
  input: "Adam/Cast_1"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"
  op: "Relu"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Conv2D_grad/Conv2DBackpropInput-0-DataFormatVecPermuteNHWCToNCHW-LayoutOptimizer"
  op: "Const"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\004\000\000 \000\000\000\030\000\000\000\030\000\000\000"
      }
    }
  }
}
node {
  name: "ConstantFolding/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_1/Conv2D_grad/ShapeN-matshapes-1"
  op: "Const"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Relu"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Relu"
  op: "Relu"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/max_pooling2d/MaxPool"
  op: "MaxPool"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Relu"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 2
        i: 2
      }
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D"
  op: "Conv2D"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/max_pooling2d/MaxPool"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Conv2D_grad/Conv2DBackpropInput-0-DataFormatVecPermuteNHWCToNCHW-LayoutOptimizer"
  op: "Const"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/max_pooling2d/MaxPool"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\004\000\000@\000\000\000\n\000\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "ConstantFolding/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d_2/Conv2D_grad/ShapeN-matshapes-1"
  op: "Const"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  input: "^StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/max_pooling2d/MaxPool"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000@\000\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd"
  op: "BiasAdd"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu"
  op: "Relu"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu-0-1-TransposeNCHWToNHWC-LayoutOptimizer"
  op: "Transpose"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu"
  input: "statefulpartitionedcall_mnist_classifier_statefulpartitionedcall_conv2d_2_relu_0_1_permconstnchwtonhwc_layoutoptimizer_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/flatten/Reshape"
  op: "Reshape"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu-0-1-TransposeNCHWToNHWC-LayoutOptimizer"
  input: "statefulpartitionedcall_mnist_classifier_statefulpartitionedcall_flatten_const_0_arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul"
  op: "MatMul"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/flatten/Reshape"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd"
  op: "BiasAdd"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"
  op: "Relu"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul"
  op: "MatMul"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/Relu"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd"
  op: "BiasAdd"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"
  op: "Softmax"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value/Minimum_grad/LessEqual"
  op: "LessEqual"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/sub"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"
  op: "Minimum"
  input: "StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/Softmax"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/sub"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/GreaterEqual"
  op: "GreaterEqual"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"
  input: "Adam/Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"
  op: "Maximum"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value/Minimum"
  input: "Adam/Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Log"
  op: "Log"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"
  op: "SparseSoftmaxCrossEntropyWithLogits"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Log"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast_1"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tlabels"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "statefulpartitionedcall_partitionedcall_sparse_categorical_crossentropy_sparsesoftmaxcrossentropywithlogits_sparsesoftmaxcrossentropywithlogits_0_retval_RetVal"
  op: "_Retval"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
node {
  name: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/mul"
  op: "Mul"
  input: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits:1"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
  name: "PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/Log_grad/Reciprocal"
  op: "Reciprocal"
  input: "StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/clip_by_value"
  input: "^PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/mul"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
}
node {
