node {
  name: "unclustered/StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/weighted_loss/Const_1"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
  experimental_debug_info {
    original_node_names: "sparse_categorical_crossentropy/weighted_loss/Const_1"
    original_func_names: "__forward_compute_loss_366"
  }
}
node {
  name: "unclustered/StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/weighted_loss/num_elements/Cast"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        tensor_content: "\000\000\200D"
      }
    }
  }
  experimental_debug_info {
    original_node_names: "sparse_categorical_crossentropy/weighted_loss/num_elements/Cast"
    original_func_names: "__forward_compute_loss_366"
  }
}
node {
  name: "unclustered/adam_adam_update_9_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_9/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 34
    }
  }
}
node {
  name: "unclustered/adam_adam_update_9_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_9/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 35
    }
  }
}
node {
  name: "unclustered/adam_adam_update_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 1
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 16
    }
  }
}
node {
  name: "unclustered/adam_adam_update_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 1
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 17
    }
  }
}
node {
  name: "cluster_0/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-PermConstNHWCToNCHW-LayoutOptimizer"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\003\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "unclustered/adam_adam_update_1_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_1/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 18
    }
  }
}
node {
  name: "unclustered/adam_adam_update_1_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_1/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 19
    }
  }
}
node {
  name: "unclustered/adam_adam_update_2_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_2/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 32
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 20
    }
  }
}
node {
  name: "unclustered/adam_adam_update_2_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_2/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 32
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 21
    }
  }
}
node {
  name: "unclustered/adam_adam_update_3_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_3/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 22
    }
  }
}
node {
  name: "unclustered/adam_adam_update_3_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_3/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 23
    }
  }
}
node {
  name: "unclustered/adam_adam_update_4_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_4/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 64
          }
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 24
    }
  }
}
node {
  name: "unclustered/adam_adam_update_4_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_4/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 64
          }
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 25
    }
  }
}
node {
  name: "unclustered/adam_adam_update_5_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_5/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 26
    }
  }
}
node {
  name: "unclustered/adam_adam_update_5_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_5/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 27
    }
  }
}
node {
  name: "cluster_0/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/flatten/Reshape_grad/Shape"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\004\000\000\006\000\000\000\006\000\000\000\200\000\000\000"
      }
    }
  }
  experimental_debug_info {
    original_node_names: "gradients/flatten/Reshape_grad/Shape"
    original_func_names: "__inference___backward_call_389_453"
  }
}
node {
  name: "unclustered/adam_adam_update_6_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_6/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 4608
          }
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 28
    }
  }
}
node {
  name: "unclustered/adam_adam_update_6_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_6/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 4608
          }
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 29
    }
  }
}
node {
  name: "unclustered/adam_adam_update_7_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_7/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 30
    }
  }
}
node {
  name: "unclustered/adam_adam_update_7_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_7/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 31
    }
  }
}
node {
  name: "unclustered/adam_adam_update_8_resourceapplyadam_m"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_8/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 32
    }
  }
}
node {
  name: "unclustered/adam_adam_update_8_resourceapplyadam_v"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Adam/Adam/update_8/ResourceApplyAdam"
      }
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 33
    }
  }
}
node {
  name: "unclustered/adam_readvariableop_resource"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 13
    }
  }
}
node {
  name: "cluster_0/Adam/add/y"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "unclustered/adam_cast_readvariableop_resource"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 12
    }
  }
}
node {
  name: "unclustered/adam_cast_2_readvariableop_resource"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 14
    }
  }
}
node {
  name: "unclustered/adam_cast_3_readvariableop_resource"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 15
    }
  }
}
node {
  name: "cluster_0/PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
          dim {
            size: 1
          }
        }
        float_val: 0.0009765625
      }
    }
  }
  experimental_debug_info {
    original_node_names: "gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims"
    original_func_names: "__inference___backward_compute_loss_284_367"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/sub"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        tensor_content: "\376\377\177?"
      }
    }
  }
  experimental_debug_info {
    original_node_names: "sparse_categorical_crossentropy/sub"
    original_func_names: "__forward_compute_loss_366"
  }
}
node {
  name: "cluster_0/Adam/Const"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1e-07
      }
    }
  }
}
node {
  name: "unclustered/y_true"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1024
          }
        }
      }
    }
  }
  attr {
    key: "_user_specified_name"
    value {
      s: "y_true"
    }
  }
  attr {
    key: "index"
    value {
      i: 1
    }
  }
}
node {
  name: "cluster_0/PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1024
          }
          dim {
            size: 10
          }
        }
        float_val: 0
      }
    }
  }
  experimental_debug_info {
    original_node_names: "gradients/sparse_categorical_crossentropy/clip_by_value_grad/zeros"
    original_func_names: "__inference___backward_compute_loss_284_367"
  }
}
node {
  name: "cluster_0/PartitionedCall/gradients/PartitionedCall_grad/PartitionedCall_10/gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims/dim"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
  experimental_debug_info {
    original_node_names: "gradients/sparse_categorical_crossentropy/SparseSoftmaxCrossEntropyWithLogits/SparseSoftmaxCrossEntropyWithLogits_grad/ExpandDims/dim"
    original_func_names: "__inference___backward_compute_loss_284_367"
  }
}
node {
  name: "unclustered/data"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1024
          }
          dim {
            size: 28
          }
          dim {
            size: 28
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "_user_specified_name"
    value {
      s: "data"
    }
  }
  attr {
    key: "index"
    value {
      i: 0
    }
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Relu-0-1-PermConstNCHWToNHWC-LayoutOptimizer"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\002\000\000\000\003\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/flatten/Const"
  op: "Const"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\000\022\000\000"
      }
    }
  }
  experimental_debug_info {
    original_node_names: "flatten/Const"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "unclustered/unknown_0"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 3
    }
  }
}
node {
  name: "unclustered/unknown"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 1
          }
          dim {
            size: 32
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 2
    }
  }
}
node {
  name: "unclustered/unknown_2"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 5
    }
  }
}
node {
  name: "unclustered/unknown_1"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 32
          }
          dim {
            size: 64
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 4
    }
  }
}
node {
  name: "unclustered/unknown_4"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 7
    }
  }
}
node {
  name: "unclustered/unknown_3"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 5
          }
          dim {
            size: 5
          }
          dim {
            size: 64
          }
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 6
    }
  }
}
node {
  name: "unclustered/unknown_6"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 9
    }
  }
}
node {
  name: "unclustered/unknown_5"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 4608
          }
          dim {
            size: 128
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 8
    }
  }
}
node {
  name: "unclustered/unknown_8"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 11
    }
  }
}
node {
  name: "unclustered/unknown_7"
  op: "_Arg"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_handle_dtypes"
    value {
      list {
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_handle_shapes"
    value {
      list {
        shape {
          dim {
            size: 128
          }
          dim {
            size: 10
          }
        }
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "index"
    value {
      i: 10
    }
  }
}
node {
  name: "cluster_0/Adam/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/adam_readvariableop_resource"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "cluster_0/Adam/Cast/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/adam_cast_readvariableop_resource"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cluster_0/Adam/Cast_2/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/adam_cast_2_readvariableop_resource"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cluster_0/Adam/Cast_3/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/adam_cast_3_readvariableop_resource"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast"
  op: "Cast"
  input: "unclustered/y_true"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  experimental_debug_info {
    original_node_names: "sparse_categorical_crossentropy/Cast"
    original_func_names: "__forward_compute_loss_366"
  }
}
node {
  name: "cluster_0/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-TransposeNHWCToNCHW-LayoutOptimizer"
  op: "Transpose"
  input: "unclustered/data"
  input: "cluster_0/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-PermConstNHWCToNCHW-LayoutOptimizer/clone_0"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_0"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d/BiasAdd/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d/Conv2D/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_2"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d_1/BiasAdd/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_1"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d_1/Conv2D/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_4"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d_2/BiasAdd/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_3"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d_2/Conv2D/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_6"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "dense/BiasAdd/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_5"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "dense/MatMul/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_8"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "dense_1/BiasAdd/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "unclustered/unknown_7"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  experimental_debug_info {
    original_node_names: "dense_1/MatMul/ReadVariableOp"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/Adam/add"
  op: "AddV2"
  input: "cluster_0/Adam/ReadVariableOp"
  input: "cluster_0/Adam/add/y"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast_1"
  op: "Cast"
  input: "cluster_0/StatefulPartitionedCall/PartitionedCall/sparse_categorical_crossentropy/Cast"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "DstT"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  experimental_debug_info {
    original_node_names: "sparse_categorical_crossentropy/Cast_1"
    original_func_names: "__forward_compute_loss_366"
  }
}
node {
  name: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D"
  op: "Conv2D"
  input: "cluster_0/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/Conv2DBackpropFilter-0-TransposeNHWCToNCHW-LayoutOptimizer"
  input: "cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
  experimental_debug_info {
    original_node_names: "conv2d/Conv2D"
    original_func_names: "__forward_call_452"
  }
}
node {
  name: "cluster_0/ConstantFolding/PartitionedCall/gradients/mnist_classifier/StatefulPartitionedCall_grad/PartitionedCall/gradients/conv2d/Conv2D_grad/ShapeN-matshapes-1"
  op: "Const"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  input: "^unclustered/data"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\001\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "cluster_0/Func/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/output_control_node/_104"
  op: "NoOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/BiasAdd/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d/Conv2D/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/BiasAdd/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_1/Conv2D/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/BiasAdd/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/conv2d_2/Conv2D/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/BiasAdd/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense/MatMul/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/BiasAdd/ReadVariableOp"
  input: "^cluster_0/StatefulPartitionedCall/mnist_classifier/StatefulPartitionedCall/dense_1/MatMul/ReadVariableOp"
  device: "/job:localhost/replica:0/task:0/device:GPU:0"
  attr {
    key: "_XlaAlreadyClustered"
    value {
      b: true
    }
  }
  attr {
    key: "_XlaCluster"
    value {
      s: "cluster_0"
    }
  }
}
node {
  name: "cluster_0/Adam/Cast_1"
  op: "Cast"
  input: "cluster_0/Adam/add"
